# Introduction to DataFrame and DataSeries
### Definitions
- Data frames are two dimentional data structues which contains data in a form of raws and columns and their corrosponding lables.
- Data series are raws of a data frame and their labels are column names.
- Series, either it can be raws of a column or columns of a raw.

In [1]:
import pandas as pd

In [2]:
data = {
    "name": ['Faraz', 'Ali', 'Sameer', 'Sarab'],
    "roll_number": [111,222,333,444],
    "email": ['faraz@example.com','ali@example.com','sameer@example.com','sarab@example.com']
}

In [5]:
data.keys()

dict_keys(['name', 'roll_number', 'email'])

In [10]:
df = pd.DataFrame(data, index=range(4), columns= data.keys())
df

     name  roll_number               email
0   Faraz          111   faraz@example.com
1     Ali          222     ali@example.com
2  Sameer          333  sameer@example.com
3   Sarab          444   sarab@example.com

In [11]:
df = pd.DataFrame(data)
df

     name  roll_number               email
0   Faraz          111   faraz@example.com
1     Ali          222     ali@example.com
2  Sameer          333  sameer@example.com
3   Sarab          444   sarab@example.com

In [13]:
minam = pd.Series(data=['Minam', 555, 'minam@example.com'], index=df.columns, name=4)

In [16]:
df= df.append(minam)

     name  roll_number               email
0   Faraz          111   faraz@example.com
1     Ali          222     ali@example.com
2  Sameer          333  sameer@example.com
3   Sarab          444   sarab@example.com
4   Minam          555   minam@example.com
4   Minam          555   minam@example.com

In [17]:
df

     name  roll_number               email
0   Faraz          111   faraz@example.com
1     Ali          222     ali@example.com
2  Sameer          333  sameer@example.com
3   Sarab          444   sarab@example.com
4   Minam          555   minam@example.com

In [19]:
df.loc[1,:]

name                       Ali
roll_number                222
email          ali@example.com
Name: 1, dtype: object

In [28]:
df.loc[[0,3,4],['name','email']]

    name              email
0  Faraz  faraz@example.com
3  Sarab  sarab@example.com
4  Minam  minam@example.com

In [29]:
df[['name','email']]

     name               email
0   Faraz   faraz@example.com
1     Ali     ali@example.com
2  Sameer  sameer@example.com
3   Sarab   sarab@example.com
4   Minam   minam@example.com